readme: real readme
